import { LucideDollarSign, LucideShieldCheck } from 'lucide-react';

export function InfoBlock() {
  return (
    <div className='mb-4 w-full space-y-2'>
      {/* Первый блок: Выводы с комиссией */}
      <div className='flex flex-col'>
        <h3 className='mb-1 text-sm font-semibold text-white underline decoration-purple-400 decoration-2 underline-offset-2'>
          Выводы с комиссией 0%
        </h3>
        <p className='mb-2 max-w-[90%] text-[10px] text-zinc-400'>
          Пополняйте и выводите ваши средства по желанию без внутренней комиссии
        </p>
        <div className='relative flex items-start gap-1 rounded-[4px] border border-white/20 p-2'>
          <div className='flex-1'>
            <div className='flex items-center'>
              <LucideDollarSign className='mb-1 mr-1 h-3 w-3 text-purple-400' />
              <h4 className='mb-1 text-sm font-semibold text-white'>
                Двойные стандарты
              </h4>
            </div>
            <p className='line-clamp-2 max-w-[50%] text-[10px] text-zinc-400'>
              Конвертация валют без APR и комиссий
            </p>
          </div>
          <svg
            fill='#c27aff'
            height='32px'
            width='32px'
            xmlns='http://www.w3.org/2000/svg'
            viewBox='0 0 490 490'
            className='absolute right-4 top-4 opacity-80'
          >
            <path d='M250.135,180.623v-18.601c18.242-3.044,27.981-16.284,27.981-30.414c0-15.92-9.207-25.227-27.449-32.736 c-15.406-6.441-21.959-11.091-21.959-20.397c0-7.157,5.135-15.383,18.774-15.383c11.334,0,18.591,3.934,22.314,6.083l4.426-11.807 c-5.135-3.044-12.398-5.903-23.023-6.262V33.752h-10.98v18.069c-16.292,2.68-26.74,13.951-26.74,28.802 c0,15.562,11.157,23.794,29.222,30.945c13.101,5.366,20.009,11.449,20.009,21.293c0,10.196-8.503,17.532-21.073,17.532 c-9.922,0-19.129-3.402-25.505-7.695l-4.249,11.987c6.199,4.471,16.824,7.695,27.095,7.868v18.069H250.135z'></path>{' '}
            <path d='M91.875,384.65c25.033,0,45.324-20.293,45.324-45.325c0-22.421-16.284-41.028-37.668-44.667v-30.621H388.33v31.038 c-20.322,4.478-35.53,22.583-35.53,44.251c0,25.032,20.292,45.325,45.324,45.325s45.324-20.293,45.324-45.325 c0-23.163-17.379-42.254-39.807-44.978v-45.623H252.656v-34.616c56.613-3.874,101.46-50.351,101.46-106.92 C354.116,48.091,305.173,0,245,0S135.883,48.091,135.883,107.188c0,56.568,44.847,103.046,101.46,106.92v34.616H84.219v45.934 c-21.384,3.64-37.668,22.246-37.668,44.667C46.551,364.357,66.842,384.65,91.875,384.65z M428.137,339.324 c0,16.549-13.462,30.013-30.012,30.013c-16.55,0-30.012-13.464-30.012-30.013c0-16.549,13.462-30.012,30.012-30.012 C414.675,309.313,428.137,322.776,428.137,339.324z M151.196,107.188c0-50.663,42.079-91.875,93.804-91.875 s93.804,41.212,93.804,91.875S296.725,199.063,245,199.063S151.196,157.85,151.196,107.188z M91.875,309.313 c16.55,0,30.012,13.463,30.012,30.012c0,16.549-13.462,30.013-30.012,30.013c-16.55,0-30.012-13.464-30.012-30.013 C61.863,322.776,75.325,309.313,91.875,309.313z'></path>{' '}
            <path d='M0,437.937C0,480.2,0,490,0,490s89.423,0,89.733,0l-43.795-94.938C45.938,395.062,0,395.674,0,437.937z M15.313,474.688 v-36.75c0-17.486,12.154-23.891,21.44-26.232l29.055,62.983H15.313z'></path>{' '}
            <path d='M137.813,395.062L94.017,490h89.733c0,0,0-9.8,0-52.063C183.75,395.674,137.813,395.062,137.813,395.062z M168.438,474.688 h-50.495l29.055-62.983c9.286,2.341,21.44,8.746,21.44,26.232V474.688z'></path>{' '}
            <polygon points='91.875,395.062 60.331,395.062 91.875,464.887 123.419,395.062 '></polygon>{' '}
            <path d='M306.25,437.937c0,42.263,0,52.063,0,52.063s89.423,0,89.733,0l-43.795-94.938 C352.188,395.062,306.25,395.674,306.25,437.937z M321.563,474.688v-36.75c0-17.486,12.154-23.891,21.44-26.232l29.055,62.983 H321.563z'></path>{' '}
            <path d='M444.063,395.062L400.267,490H490c0,0,0-9.8,0-52.063C490,395.674,444.063,395.062,444.063,395.062z M474.688,474.688 h-50.495l29.055-62.983c9.286,2.341,21.44,8.746,21.44,26.232V474.688z'></path>{' '}
            <polygon points='398.125,395.062 366.581,395.062 398.125,464.887 429.669,395.062 '></polygon>{' '}
          </svg>
        </div>
      </div>

      {/* Второй блок: Защита основной суммы */}
      <div className='flex flex-col'>
        <h3 className='mb-1 text-sm font-semibold text-white underline decoration-purple-400 decoration-2 underline-offset-4'>
          Защита основной суммы
        </h3>
        <p className='mb-2 max-w-[80%] text-[10px] text-zinc-400'>
          Получайте стабильный доход с сохранением исходной суммы
        </p>
        <div className='relative flex items-start gap-1 rounded-[4px] border border-white/20 p-2'>
          <div className='flex-1'>
            <div className='flex items-center'>
              <LucideShieldCheck className='mb-1 mr-1 h-3 w-3 text-purple-400' />
              <h4 className='mb-1 text-sm font-semibold text-white'>
                PLUS Fin
              </h4>
            </div>
            <p className='line-clamp-2 max-w-[70%] text-[10px] text-zinc-400'>
              Приумножайте ваши сбережения и получайте до 4.4% без APR*
            </p>
          </div>
          <svg
            fill='#c27aff'
            height='32px'
            width='32px'
            xmlns='http://www.w3.org/2000/svg'
            viewBox='0 0 490 490'
            stroke='#c27aff'
            className='absolute right-4 top-4 opacity-80'
          >
            <g
              id='SVGRepo_tracerCarrier'
              strokeLinecap='round'
              strokeLinejoin='round'
            ></g>
            <g id='SVGRepo_iconCarrier'>
              {' '}
              <g>
                {' '}
                <g>
                  {' '}
                  <g>
                    {' '}
                    <path d='M110.326,489.922H36.601V357.738h73.725V489.922z M51.911,474.612h43.105V373.048H51.911V474.612z'></path>{' '}
                  </g>{' '}
                  <g>
                    {' '}
                    <path d='M205.237,489.922h-73.725V290.95h73.725V489.922z M146.822,474.612h43.105V306.26h-43.105V474.612z'></path>{' '}
                  </g>{' '}
                  <g>
                    {' '}
                    <path d='M300.163,489.922h-73.725V215.805h73.725V489.922z M241.748,474.612h43.105V231.115h-43.105V474.612z'></path>{' '}
                  </g>{' '}
                  <g>
                    {' '}
                    <path d='M395.074,489.922h-73.725V140.675h73.725V489.922z M336.659,474.612h43.105V155.985h-43.105V474.612z'></path>{' '}
                  </g>{' '}
                  <g>
                    {' '}
                    <path d='M490,489.922h-73.725V90.573H490V489.922z M431.585,474.612h43.105V105.883h-43.105V474.612z'></path>{' '}
                  </g>{' '}
                </g>{' '}
                <g>
                  {' '}
                  <path d='M0,306.114L348.397,28.639L333.43,9.594l65.628-9.516L374.465,61.81l-14.967-19.046L12.904,320.992 C12.904,320.992,0.513,306.295,0,306.114z'></path>{' '}
                </g>{' '}
              </g>{' '}
            </g>
          </svg>
        </div>
      </div>
    </div>
  );
}
